from .common import *

df = pd.DataFrame([
    {"客戶ID": "AAA", "客戶名稱": "123自助餐", "客戶類型": "曾詢問客戶", "上次購買/詢問日期": "紅斑魚片4/5 6K/箱", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "布穀鳥(苓雅)", "客戶類型": "潛在需求客戶", "上次購買/詢問日期": "薄鹽鯖魚100/130-6K-[無中骨]A團膳用", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "稻芝香", "客戶類型": "曾詢問客戶", "上次購買/詢問日期": "薄鹽鯖魚100/130-5K-[無中骨]團膳用", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "八香廚房", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "青花菜(1K*10包)-佳旻", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "北高美家具工", "客戶類型": "潛在需求客戶", "上次購買/詢問日期": "哈克魚100/120 10K-津湧", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大高樹自助餐", "客戶類型": "潛在需求客戶", "上次購買/詢問日期": "四季豆(1K*10包)", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大翰便當", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "暑魚切塊(帶皮){尾}[無購買數量/頻率]-6K", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大和食堂(苓", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "金目鱸魚(蝴蝶切)[真空](450/500)戎-A", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "東皇快餐", "客戶類型": "潛在需求客戶", "上次購買/詢問日期": "杏鮑菇下角料(3K/包)-B", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大王便當", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "裹漿紐澳良腿排(50片/箱)-羅德", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "123自助餐", "客戶類型": "曾詢問客戶", "上次購買/詢問日期": "紅斑魚片4/5 6K/箱", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "布穀鳥(苓雅)", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "薄鹽鯖魚100/130-6K-[無中骨]A團膳用", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "稻芝香", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "薄鹽鯖魚100/130-5K-[無中骨]團膳用", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "八香廚房", "客戶類型": "曾詢問客戶", "上次購買/詢問日期": "青花菜(1K*10包)-佳旻", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "北高美家具工", "客戶類型": "潛在需求客戶", "上次購買/詢問日期": "哈克魚100/120 10K-津湧", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大高樹自助餐", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "四季豆(1K*10包)", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大翰便當", "客戶類型": "曾購買客戶", "上次購買/詢問日期": "暑魚切塊(帶皮){尾}[無購買數量/頻率]-6K", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大和食堂(苓", "客戶類型": "曾詢問客戶", "上次購買/詢問日期": "金目鱸魚(蝴蝶切)[真空](450/500)戎-A", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "東皇快餐", "客戶類型": "潛在需求客戶", "上次購買/詢問日期": "杏鮑菇下角料(3K/包)-B", "購買數量/頻率": "2025/4/16"},
    {"客戶ID": "AAA", "客戶名稱": "大王便當", "客戶類型": "曾詢問客戶", "上次購買/詢問日期": "裹漿紐澳良腿排(50片/箱)-羅德", "購買數量/頻率": "2025/4/16"},
])

@app.callback(
    Output("result-table", "data"),
    Output("result-table", "columns"),
    Input("search-button", "n_clicks"),
    State("product_name", "value"),
    State("spec", "value")
)
def filter_table(n_clicks, product_name, spec):
    
    if n_clicks>0:
        columns = [{"name": i, "id": i} for i in df.columns]
        data = df.to_dict('records')
        
        return data, columns
