"""
要用temp_customer_records
"""

from .common import *
from components.offcanvas import create_search_offcanvas, register_offcanvas_callback

df = pd.DataFrame([
    {"客戶ID": "AAA", "客戶名稱": "123自助餐", "購買日期": "2025/4/01", "新品品項": "紅斑魚片4/5 6K/箱", "規格": "2025/4/16", "購買數量": "10"},
    {"客戶ID": "AAA", "客戶名稱": "布穀鳥(苓雅)", "購買日期": "2025/4/02", "新品品項": "薄鹽鯖魚100/130-6K-[無中骨]A團膳用", "規格": "2025/4/16", "購買數量": "3"},
    {"客戶ID": "AAA", "客戶名稱": "稻芝香", "購買日期": "2025/4/03", "新品品項": "薄鹽鯖魚100/130-5K-[無中骨]團膳用", "規格": "2025/4/16", "購買數量": "50"},
    {"客戶ID": "AAA", "客戶名稱": "八香廚房", "購買日期": "2025/4/04", "新品品項": "青花菜(1K*10包)-佳旻", "規格": "2025/4/16", "購買數量": "6"},
    {"客戶ID": "AAA", "客戶名稱": "北高美家具工", "購買日期": "2025/4/05", "新品品項": "哈克魚100/120 10K-津湧", "規格": "2025/4/16", "購買數量": "14"},
    {"客戶ID": "AAA", "客戶名稱": "大高樹自助餐", "購買日期": "2025/4/06", "新品品項": "四季豆(1K*10包)", "規格": "2025/4/16", "購買數量": "22"},
    {"客戶ID": "AAA", "客戶名稱": "大翰便當", "購買日期": "2025/4/07", "新品品項": "暑魚切塊(帶皮){尾}[無規格]-6K", "規格": "2025/4/16", "購買數量": "45"},
    {"客戶ID": "AAA", "客戶名稱": "大和食堂(苓", "購買日期": "2025/4/08", "新品品項": "金目鱸魚(蝴蝶切)[真空](450/500)戎-A", "規格": "2025/4/16", "購買數量": "53"},
    {"客戶ID": "AAA", "客戶名稱": "東皇快餐", "購買日期": "2025/4/09", "新品品項": "杏鮑菇下角料(3K/包)-B", "規格": "2025/4/16", "購買數量": "35"},
    {"客戶ID": "AAA", "客戶名稱": "大王便當", "購買日期": "2025/4/10", "新品品項": "裹漿紐澳良腿排(50片/箱)-羅德", "規格": "2025/4/16", "購買數量": "1"},
    {"客戶ID": "AAA", "客戶名稱": "123自助餐", "購買日期": "2025/4/01", "新品品項": "紅斑魚片4/5 6K/箱", "規格": "2025/4/16", "購買數量": "10"},
    {"客戶ID": "AAA", "客戶名稱": "布穀鳥(苓雅)", "購買日期": "2025/4/02", "新品品項": "薄鹽鯖魚100/130-6K-[無中骨]A團膳用", "規格": "2025/4/16", "購買數量": "3"},
    {"客戶ID": "AAA", "客戶名稱": "稻芝香", "購買日期": "2025/4/03", "新品品項": "薄鹽鯖魚100/130-5K-[無中骨]團膳用", "規格": "2025/4/16", "購買數量": "50"},
    {"客戶ID": "AAA", "客戶名稱": "八香廚房", "購買日期": "2025/4/04", "新品品項": "青花菜(1K*10包)-佳旻", "規格": "2025/4/16", "購買數量": "6"},
    {"客戶ID": "AAA", "客戶名稱": "北高美家具工", "購買日期": "2025/4/05", "新品品項": "哈克魚100/120 10K-津湧", "規格": "2025/4/16", "購買數量": "14"},
    {"客戶ID": "AAA", "客戶名稱": "大高樹自助餐", "購買日期": "2025/4/06", "新品品項": "四季豆(1K*10包)", "規格": "2025/4/16", "購買數量": "22"},
    {"客戶ID": "AAA", "客戶名稱": "大翰便當", "購買日期": "2025/4/07", "新品品項": "暑魚切塊(帶皮){尾}[無規格]-6K", "規格": "2025/4/16", "購買數量": "45"},
    {"客戶ID": "AAA", "客戶名稱": "大和食堂(苓", "購買日期": "2025/4/08", "新品品項": "金目鱸魚(蝴蝶切)[真空](450/500)戎-A", "規格": "2025/4/16", "購買數量": "53"},
    {"客戶ID": "AAA", "客戶名稱": "東皇快餐", "購買日期": "2025/4/09", "新品品項": "杏鮑菇下角料(3K/包)-B", "規格": "2025/4/16", "購買數量": "35"},
    {"客戶ID": "AAA", "客戶名稱": "大王便當", "購買日期": "2025/4/10", "新品品項": "裹漿紐澳良腿排(50片/箱)-羅德", "規格": "2025/4/16", "購買數量": "1"},
])

# offcanvas
product_input_fields = [
    {
        "id": "customer-id", 
        "label": "客戶ID",
        "type": "dropdown"
    },
    {
        "id": "product-type",
        "label": "商品類別",
        "type": "dropdown"
    },
]
product_components = create_search_offcanvas(
    page_name="buy_new_item",
    input_fields=product_input_fields
)

layout = html.Div(style={"fontFamily": "sans-serif", "padding": "20px"}, children=[

    # 篩選條件區
    html.Div([
        product_components["trigger_button"],
        dbc.Button("匯出", id="export-button", n_clicks=0, color="success")
    ], className="mb-3 d-flex justify-content-between align-items-center"),

    product_components["offcanvas"],

    html.Div([
        normal_table(df)
    ],style={"marginTop": "20px"}),
])

register_offcanvas_callback(app, "buy_new_item")